USE [OdbRepairEngine];

INSERT INTO [Role](Title) VALUES
	('Менеджер')
	, ('Мастер')
	, ('Оператор')
	, ('Заказчик')

INSERT INTO [User]([Surname], [Name], [MiddleName], [Phone]) VALUES
	('Трубин', 'Никита', 'Юрьевич', '89210563128')
	, ('Мурашов', 'Андрей', 'Юрьевич', '89535078985')
	, ('Степанов', 'Андрей', 'Викторович', '89210673849')
	, ('Перина', 'Анастасия', 'Денисовна', '89990563748')
	, ('Мажитова', 'Ксения', 'Сергеевна', '89994563847')
	, ('Семенова', 'Ясмина', 'Марковна', '89994563847')
	, ('Баранова', 'Эмилия', 'Марковна', '89994563841')
	, ('Егорова', 'Алиса', 'Платоновна', '89994563842')
	, ('Титов', 'Максим', 'Иванович', '89994563843')
	, ('Иванов', 'Марк', 'Максимович', '89994563844')

INSERT INTO [Client]([UserID], [Login], [Password], [RoleID]) VALUES
    (7, 'login2', 'pass2', 4)
	, (8, 'login3', 'pass3', 4)
	, (9, 'login4', 'pass4', 4)

INSERT INTO [Employee]([UserID], [Login], [Password], [RoleID]) VALUES
	(1, 'kasoo', 'root', 1)
	, (2, 'murashov123', 'qwerty', 2)
	, (3, 'test1', 'test1', 2)
	, (4, 'perinaAD', '250519', 3)
	, (5, 'krutiha1234567', '1234567890', 1)
	, (6, 'login1', 'pass1', 2)
	, (10, 'login5', 'pass5', 2)

INSERT INTO [HomeTech]([Type]) VALUES
	('Фен')
	, ('Тостер')
	, ('Холодильник')
	, ('Стиральная машина')
	, ('Мультиварка')

INSERT INTO [TechFactory]([Title]) VALUES
	('Ладомир')
	, ('Redmond')
	, ('Indesit')
	, ('DEXP')

INSERT INTO [ModelTechFactory]([TechFactoryID], [Title]) VALUES
	(1, 'TA112')
	, (2, 'RT-437')
	, (3, 'DS 316 W')
	, (4, 'WM-F610NTMA/WW')
	, (2, 'RMC-M95')
	, (1, 'TA113')
	, (3, 'DS 314 W')

INSERT INTO [TechColor]([Color]) VALUES
	('Белый')
	, ('Чёрный')
	, ('Серый')

INSERT INTO [RequestStatus]([Status]) VALUES
	('Новая заявка')
	, ('В процессе ремонта')
	, ('Ожидание запчастей')
	, ('Готов к выдаче')

INSERT INTO [Request]([StartDate], [HomeTechID], [TechFactoryID], [ModelTechFactoryID], [TechColorID], [ProblemeDescryption], [RequestStatusID], [CompletionDate], [RepairParts], [MasterID], [ClientID]) VALUES
	('2023-06-06', 1, 1, 1, 1, 'Перестал работать', 2, '', '', 2, 1)
	, ('2023-05-05', 2, 2, 2, 2, 'Перестал работать', 2, '', '', 3, 1)
	, ('2023-07-07', 3, 3, 3, 1, 'Не морозит одна из камер холодильника', 3, '2023-01-01', '', 2, 2)
	, ('2023-08-02', 4, 4, 4, 1, 'Перестал работать многие режимы стирки', 1, '', '', NULL, 2)
	, ('2023-08-02', 5, 2, 5, 2, 'Перестал включаться', 1, '', '', NULL, 3)
	, ('2023-08-02', 1, 1, 6, 2, 'Перестал работать', 3, '2023-08-03', '', 2, 1)
	, ('2023-07-09', 3, 3, 7, 3, 'Гудит, но не замораживает', 3, '2023-08-03', 'Мотор обдува морозильной камеры холодильника', 2, 2)

INSERT INTO [Comment]([Message], [MasterID], [RequestID]) VALUES
	('Интересная поломка', 2, 1)
	, ('Очень странно, будем разбираться!', 3, 2)
	, ('Скорее всего потребуется мотор обдува', 2, 7)
	, ('Интересная поломка', 2, 1)
	, ('Очень странно, будем разбираться!', 3, 6)